In [72]:
import pandas as pd
score_df = pd.DataFrame([[1,50,80,70], 
              [2,60,45,50],
              [3,98,43,55],
              [4,70,69,89],
              [5,56,79,60],
              [6,60,68,55],
              [7,45,70,77],
              [8,55,77,76],
              [9,25,57,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])
score_df = score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score
student_id
1                   50             80             70
2                   60             45             50
3                   98             43             55
4                   70             69             89
5                   56             79             60
6                   60             68             55
7                   45             70             77
8                   55             77             76
9                   25             57             60
10                  88             40             43

In [73]:
#6 號學生(student_id=6) 3 科平均分數為何？
score_df[score_df.index==6].mean(axis=1)

student_id
6    61.0
dtype: float64

In [75]:
#6 號學生 3 科平均分數是否有贏過班上一半的同學？
score_df["score_df_mean"]=score_df.mean(axis=1) 
score_df[score_df["score_df_mean"]>61]["score_df_mean"].count()
score_df
#超過一半

            math_score  english_score  chinese_score  score_df_mean
student_id
1                   50             80             70      66.666667
2                   60             45             50      51.666667
3                   98             43             55      65.333333
4                   70             69             89      76.000000
5                   56             79             60      65.000000
6                   60             68             55      61.000000
7                   45             70             77      64.000000
8                   55             77             76      69.333333
9                   25             57             60      47.333333
10                  88             40             43      57.000000

In [77]:
#由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問 6 號同學 3 科成績分別是？

score_df2=score_df.apply(lambda x:(x**0.5)*10)
score_df2['score_df_mean']=score_df2.mean(axis=1)
score_df2

            math_score  english_score  chinese_score  score_df_mean
student_id
1            70.710678      89.442719      83.666003      81.367264
2            77.459667      67.082039      70.710678      71.782978
3            98.994949      65.574385      74.161985      79.890089
4            83.666003      83.066239      94.339811      87.062508
5            74.833148      88.881944      77.459667      80.449334
6            77.459667      82.462113      74.161985      78.046565
7            67.082039      83.666003      87.749644      79.624421
8            74.161985      87.749644      87.177979      83.089062
9            50.000000      75.498344      77.459667      67.939309
10           93.808315      63.245553      65.574385      74.531649

In [85]:
#承上題，加分後各科班平均變多少？
score_df2.mean(axis=0)

math_score       76.817645
english_score    78.666898
chinese_score    79.246180
dtype: float64